import type { Education } from "../types";

export const EDUCATIONS: Education [] = [
    {
    company: "Магистратура (РосНОУ)",
    positions: [
      {
        title: "Информационные системы и технологии (09.04.02)",
        year: "09.2023 — 07.2025",
        description: `
- ♦ Данное обучение было мне необходимо для **преподавания** и работы в **экономическом секторе IT**.
- ♦ Я изучал основы **бизнес-анализа**, погружался в концепции **децентрализованных сетей** и развивался как **старший преподаватель** на кафедре.
- ♦ Обучение дало вспомнить базовые элементы **высшей математики** и я попробовал новые языки программирования (**GoLang**, **C#**, **LabView**).
            `,
        skills: [
          "Бизнес анализ",
          "Astra",
          "Экономика",
          "Юриспруденция",
          "Преподавание",
          "Децентрализованные сети",
          "Go",
          "C#",
          "LabView",
          "Самообучение",
          "Командная работа",
          "Защита диссертаций",
        ],
      },
    ],
  },

  {
    company: "Профессиональная переподготовка",
    positions: [
      {
        title: "Педагогическое образование и судебная экспертиза",
        year: "09.2019 и 09.2022",
        description: `
- ♦ У меня было желание расширить свой стек подготовки и я расширял его в два направления: **судебное** и **педагогическое**.
- ♦ Сначала, в 2019 году, я получил пед. образование и работал учителем в школе. Ключевой задачей было — продвижение сетевой академии **Cisco NetAcad**.
- ♦ Далее, в 22 году, я пошёл получать образовании как **судебно-технический эксперт**. Здесь в мой пул обязанностей входило **консультирование** лиц во время судебных тяжб по **техническим** аспектам.
            `,
        skills: [
          "Педагогика",
          "Ведение дисциплин",
          "ФГОС",
          "Юриспруденция",
          "Преподавание",
          "Судебный процесс",
          "ГК",
          "УК",
          "Бизнес консультации",
          "Техническая экспертиза",
        ],
      },
    ],
  },

  {
    company: "Бакалавириат (МИИГАиК)",
    positions: [
      {
        title: "Информационная безопасность (10.03.01)",
        year: "09.2017 — 07.2021",
        description: `
- ♦ Учился в университете геодезии и криптографии, где упор был на **топографическую разведку** и **дистанционное зондирование Земли**.
- ♦ Во время обучения мы очень активно занимались разработкой программного обеспечения для **защищённое передачи данных в разных средах**.
- ♦ Помимо современных языков программирования и техник шифрования, мы изучали и такие языки как **Delphi** и **машину Тьюринга**.
- ♦ Обучение дало фантастический навыки **топографического нивелирования**, что полезно при проектировании зданий и **инженерное черчение**.
            `,
        skills: [
          "Python",
          "Linux",
          "SQL",
          "Топография",
          "Черчение",
          "Сети",
          "Шифрование",
          "Базовые алгоритмы",
          "Разработка ПО",
          "Самодисциплина",
          "Написание статей",
          "Спитчинг",
        ],
      },
    ],
  },
];

