import type { Experience } from "../types";

export const EXPERIENCES: Experience[] = [
  {
    company: "Монтировка",
    positions: [
      { title: "Technical Lead",
        year: "08.2021 — 02.2026",
        description: `
- ♦ *Архитектура и запуск технической платформы инди-студии (**инфраструктура, CI/CD, безопасность**)*
- ♦ *Проектирование процессов разработки и выпуска продуктов*
- ♦ *Technical enablement команды: стандарты, инструменты, онбординг*
- ♦ *Ответственность за **устойчивость решений** и **технические риски***` 
      },
    ],
  },

  {
    company: "Яндекс.Облако / Консилиум М.Д. 24",
    positions: [
      { title: "Cloud & Security Architect",
        year: "08.2020 — настоящее время",
        description: `
- ♦ *Подготовка компаний к **аккредитации** и **требованиям вендоров** (Cisco, Microsoft и др.)*
- ♦ *Архитектурные решения для **облачной и офисной инфраструктуры***
- ♦ *Анализ рисков, проектирование сетей, DMZ и моделей доступа*
- ♦ *Консультирование руководства по **технологическим и архитектурным** решениям*
- ♦ *Работа с **распределёнными командами** и регионами РФ*`
      },
    ],
  },

  {
    company: "Яндекс.Практикум / Skillbox / Нетология",
    positions: [
      { title: "Technical Enablement",
        year: "09.2017 — настоящее время",
        description: `
- ♦ *Разработка и проведение **программ** по архитектуре, сетям и информационной безопасности*
- ♦ ***Корпоративное обучение** команд под реальные инфраструктурные и security-задачи*
- ♦ *Работа с крупными **EdTech** платформами (Нетология, Skillbox, Яндекс.Практикум)*
- ♦ *Подготовка инженеров и архитекторов к **сертификации и работе** с облаками и безопасностью*`  
      },
    ],
  },
];

