import type { Experience } from "../types";

export const EXPERIENCES: Experience[] = [
  {
    company: "Монтировка",
    positions: [
      {
        title: "Генеральный директор",
        year: "08.2021 — present",
        description: `
- ♦ Мой самый последний и самый **амбициозный** проект. В нём, мы с командой занимаемся **разработкой игр** в инди студии "**Монтировка**" 🤘.
            `,
        skills: [
          "C#",
          "Unity",
          "Инфраструктура",
          "Git",
          "Node.js",
          "Astro",
          "Docker",
          "Terraform",
          "SQL",
          "Сети",
          "Безопасность",
          "ООП",
        ]
      },
    ],
  },

  {
    company: "Университеты (РосНОУ, B&D, МИИГАиК)",
    positions: [
      {
        title: "Старший преподаватель",
        year: "10.2019 — настоящее время",
        description: `
- ♦ Сейчас я **старший преподаватель** на кафедре телекоммуникационных систем и технологий в Российском новом университете.
- ♦ За мной закреплена **лаборатория сетевого оборудования Cisco** с макетными образцами и **лаборатория технического исследования персональных компьютеров**.
- ♦ Ранее, в 23-24 учебном году, я являлся старшим преподавателем в институте бизнеса и дизайна (B&D) и занимался разработкой инновационной программы по **геймифицированию** бизнес процессов.
- ♦ В ВУЗ, где я учился, за мной была закреплена должность техника, так как на момент устройства (2019 год) у меня не было оконченного высшего образования. Однако, в мои обязанности входила **разработка учебных программ** и **адаптация программ** под современные технологии.
            `,
        skills: [
          "Python",
          "C#",
          "Сети",
          "SQL",
          "Безопасность",
          "Физика",
          "Высшая математика",
          "Проектирование архитектур",
        ],
      },
    ],
  },

    {
    company: "Фриланс | EdTech | Проектные работы",
    positions: [
      {
        title: "Программист/инженер",
        year: "01.2016 — настоящее время",
        description: `
- ♦ Более пяти лет занимаюсь внешними проектами и фрилансом. Работал на площадках **Globalfreelance**, **Хабр Фриланс**, **Kwork** и другие.
- ♦ С 2020 года в EdTech-индустрии. Сначала преподавал курсы **Cisco**, работал с фондом **IqOption**, а затем стал экспертом **Нетологии** и **Skillbox**.
- ♦ Являюсь ментором на **Solvery**. Помогаю с карьерным ростом и занимаюсь адаптацией инфраструктур коллег.
- ♦ Консультирую бизнес по вопросам **релевантной архитектуры** предприятий под их задачи.
- ♦ Неоднократно строил инфраструктуры по концепциям **DevOps** и **DevSecOps**, а также разрабатывал решения на основе **облачной инфраструктуры**.
- ♦ Сейчас я активно работаю над созданием новых курсов и технологий в **Яндекс.Облаке**, а также внедряю **облачные технологии** экосистемы Яндекса в сторонние проекты.
            `,
        skills: [
          "Cisco",
          "Фриланс",
          "Финансы",
          "DevOps",
          "DevSecOps",
          "PaaS",
          "SaaS",
          "IaaS",
          "Python",
          "Bash",
          "Сети",
          "Безопасность",
        ],
      },
    ],
  },

  {
    company: "Консилиум М.Д.24",
    positions: [
      {
        title: "Системный администратор",
        year: "12.2019 — 09.2023",
        description: `
- ♦ С приходом на новое место, у меня расширился пул направлений подготовки по сертификации Cisco до **36 направлений**.
- ♦ Также, занимался администрированием трёх сайтов, но уже на **WordPress**. Также, переводил сайты с PHP на CMS Tilda и WP.
- ♦ Расширилась работа с настройкой инфраструктуры предприятия. Настраивал работу **IP-телефонии** для колл-центра и настраивал **демилитаризованную зону** предприятия с Cisco ASA.
            `,
        skills: [
          "DMZ",
          "IP-телефония",
          "Сети",
          "Информационная безопасность",
          "Kubernetes",
          "Docker",
        ],
      },
    ],
  },

  {
    company: "Рамикс",
    positions: [
      {
        title: "ИТ-специалист",
        year: "04.2018 — 10.2019",
        description: `
- ♦ Работал с оборудованием **Cisco** и являлся ведущим инструктором Cisco по направлениям IT Essentials, CCNA, CCNA Security и ещё **24 направлениям** подготовки.
- ♦ **Поддерживал офис** в настройке всех рабочих машин персонала от сборки до программной настройки. Поддерживал офис в более чем **20 человек**.
- ♦ Работал администратором семи сайтов на **самописном PHP-движке**. Работал с адаптацией, ускорением и оптимизацией сайта.
            `,
        skills: ["PHP", "Администрирование", "Cisco", "Поддержка", "Коммуникации"],
      },
    ],
  },

  {
    company: "Школа 2107",
    positions: [
      {
        title: "Учитель информатики",
        year: "09.2017 — 01.2023",
        description: `
- ♦ Школа 2107 — это школа, в которой я обучался. Я устроился туда сначала преподавателем **доп. образования**, потом вырос до **учителя** информатики.
- ♦ Я был куратором **IT и инженерных** классов, так как к этому моменту я стал **аккредитованным преподавателем Cisco NetAcad** и поступил в университет.
- ♦ Моими ключевыми обязанностями было **преподавание** технических дисциплин и работа над **олимпиадами** и **проектами** школьников.
            `,
        skills: ["Преподавание", "Программирование", "Cisco", "Проекты", "Олимпиады"],
      },
    ],
  },
];

