export const PROFILE_INFO = {
  role: 'Enterprise Architect / Архитектор предприятия',
  logo: 'Валерий Линьков',
  slogan: 'Из хаоса — архитектура, из архитектуры — безопасность, из заний — уверенность',
  displayName: "Валерий Линьков",
  email: "valerylinkov2504@yandex.ru",
  about: `
  Я **архитектор предприятия** или **Enterprise Architect**, который уже более 10 лет развивается в области **информационной безопасности**.
  На протяжении всего этого времени я разрабатывал на разных высокоуровневых языках и преподавал то, как это делать правильно. 
`,
} as const;

