export const PROFILE_INFO = {
  role: 'Cloud & Security Architect / Technical Enablement',
  logo: 'Валерий Линьков',
  slogan: 'Помогаю превратить сложную инфраструктуру в понятные и безопасные решения',
  displayName: "Валерий Линьков",
  email: "valerylinkov2504@yandex.ru",
  about: `
  Проектирую 123 облачную инфраструктуру и системы безопасности. Помогаю командам внедрять их в работу так, чтобы решения были поняты, приняты и поддерживались в реальной эксплуатации.

  Работаю с архитектурой, аутентификацией и управлением доступами, а также с инженерными процессами и обучением команд. Моя зона — настроить систему так, чтобы с ней было легко и понятно работать и чтобы она соответствовала всем требованиям безопасности и масштабируемости.

  Занимаюсь архитектурными аудитами, консалтингом и technical enablement: объясняю решения, выстраиваю подходы и помогаю командам работать с архитектурой и безопасностью осознанно. Не беру 24/7 эксплуатацию и “починку по тикетам”.
`,
} as const;

